controllers/LookupPendapatanController.php

SELECT * FROM `lookup_pendapatan` WHERE `id`='1'
---
    protected function findModel($id)
    {
        if (($model = LookupPendapatan::findOne($id)) !== null) {