controllers/MaklumatPelajarPenjagaController.php

    protected function findModel($id)
    {
        if (($model = MaklumatPelajarPenjaga::findOne($id)) !== null) {
---
SELECT * FROM `maklumat_pelajar_penjaga` WHERE `id`='2845'